Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: A predefined L</character class> matchable by the C<\p> L</metasymbol>.
es: L<Clase de caracteres|/clase de caracteres> que se puede detectar mediante el L</metasímbolo> C<\p>.

source: A process that has died (exited) but whose parent has not yet received proper notification of its demise by virtue of having called L<wait|perlfunc/wait> or L<waitpid|perlfunc/waitpid>.
es: Proceso fallecido (finalizado) cuyo proceso primario aún no ha recibido la notificación correspondiente por haber llamado a L<wait|perlfunc/wait> o L<waitpid|perlfunc/waitpid>.

source: A program designed to take a L</stream> of input and transform it into a stream of output.
es: Programa que consume una L</secuencia> de entrada y la transforma en una secuencia de salida.

source: A program is what you give the audience."
es: y que un programa es lo que se ofrece al público."

source: A program like Perl must somehow remember all the names of all the L<variables|/variable>, L<filehandles|/filehandle>, and L<subroutines|/subroutine> you've used.
es: Un programa como el intérprete perl debe recordar todos los nombres de todas las L<variables|/variable>, L<identificadores de archivos|/identificador de archivo> y L<subrutinas|/subrutina> que se han usado.

source: A program or subroutine that runs some other program or subroutine for you, modifying some of its input or output to better suit your purposes.
es: Programa o subrutina que ejecuta automáticamente otro programa o subrutina, modificando parte de la entrada o la salida para adaptar mejor el resultado a sus necesidades.

source: A program technique that lets you evaluate an L</expression> and then, based on the value of the expression, do a multiway branch to the appropriate piece of code for that value.
es: Técnica de programación que permite evaluar una L</expresión> y, a continuación, en función del valor de la expresión, bifurcar la ejecución al fragmento de código correspondiente a ese valor.

source: A program that lets you step through the L<execution|/execute> of your program, stopping or printing things out here and there to see whether anything has gone wrong, and if so, what.
es: Programa que permite recorrer paso a paso la L<ejecución|/ejecutar> del programa, deteniéndose en distintos puntos para ver si se ha producido algún error y, en caso afirmativo, cuál.

source: A protocol wrapped around the Internet Protocol to make an unreliable packet transmission mechanism appear to the application program to be a reliable L</stream> of bytes.
es: Protocolo que envuelve al Protocolo de Internet y que hace que un programa de aplicación vea un mecanismo de transmisión de paquetes poco fiable como una L</secuencia> de bytes fiable.

source: A pseudo-hash is an array reference which can be accessed using named keys like a hash.
es: Un seudohash es una referencia a un array al que se puede acceder mediante claves con nombre, como si fuera un hash.

source: A psychoactive drug, popular in the 80s, probably developed at U. C. Berkeley or thereabouts.
es: Droga psicoactiva, popular en los años ochenta, y probablemente diseñada en la U. C. Berkeley o en sus alrededores.

source: A question mark was chosen for this and for the minimal-matching construct because 1) question marks are rare in older regular expressions, and 2) whenever you see one, you should stop and "question" exactly what is going on.
es: Se eligió un signo de interrogación para esto y para la construcción de detección de coincidencias mínima porque: 1) los signos de interrogación son poco frecuentes en expresiones regulares antiguas, y 2) cada vez que se ve uno, hay que pararse a pensar qué es lo que hace.

source: A read-write accessor will allow the caller to set the value as well as get it:
es: Un método de acceso de lectura y escritura permite que el código que lo llama establezca y recupere el valor:

source: A recreational vehicle, not to be confused with vehicular recreation.
es: Vehículo recreativo ("recreational vehicle" en inglés). No debe confundirse con "vehicular recreation" (excursiones campo a través).

source: A reference is a scalar value and can refer to any other Perl data type.
es: Una referencia es un valor escalar que puede apuntar a cualquier tipo de datos de Perl.

source: A reference to an array whose initial element happens to hold a reference to a hash.
es: Referencia a un array cuyo primer elemento parece contener una referencia a un hash.

source: A relationship between two L<objects|/object> in which one object is considered to be a more specific version of the other, generic object: "A camel is a mammal." Since the generic object really only exists in a Platonic sense, we usually add a little abstraction to the notion of objects and think of the relationship as being between a generic L</base class> and a specific L</derived class>.
es: es-un. Relación entre dos L<objetos|/objeto> en la que se considera que un objeto es una versión más específica del otro, que es un objeto genérico: "Un camello es un mamífero". Como en realidad el objeto genérico sólo existe en un sentido platónico, normalmente agregamos un pequeña abstracción a la noción de objetos, y pensamos en la relación como una relación entre una L</clase base> genérica y una L</clase derivada> específica.

source: A relatively new conference franchise with a large Perl portion is the Open Source Developers Conference or OSDC.
es: La I<Open Source Developers Conference> (OSDC) es una franquicia de conferencias relativamente nueva que incluye un porcentaje elevado de charlas sobre Perl.

source: A remark that doesn't affect the meaning of the program.
es: Observación que no afecta al significado del programa.

source: A scalar context sometimes imposes additional constraints on the return value--see L</string context> and L</numeric context>.
es: A veces un contexto escalar impone restricciones adicionales al valor devuelto (vea L</contexto de cadena> y L</contexto numérico>).

source: A scalar is a single string (of any size, limited only by the available memory), number, or a reference to something (which will be discussed in L<perlref>).
es: Un escalar es una cadena (de cualquier tamaño, limitado únicamente por la memoria disponible), un número o una referencia a algo (las referencias se describen en L<perlref>).

source: A scalar may contain one single value in any of three different flavors: a number, a string, or a reference.
es: Un escalar puede contener un único valor perteneciente a uno de tres tipos posibles: número, cadena o referencia.

source: A scalar represents a single value:
es: Un escalar representa un solo valor:

source: A scalar value is interpreted as FALSE in the Boolean sense if it is undefined, the null string or the number 0 (or its string equivalent, "0"), and TRUE if it is anything else.
es: Un valor escalar se interpreta como FALSO, en el sentido booleano, si está indefinido, es la cadena nula o el número 0 (o su cadena equivalente, "0"), y como VERDADERO si es cualquier otra cosa.

source: A selection of any number of L<elements|/element> from a L</list>, L</array>, or L</hash>.
es: Selección de un número de L<elementos|/elemento> de una L</lista>, un L</array> o un L</hash>.

source: A sequence of L<bits|/bit> that is actually being thought of as a sequence of bits, for once.
es: Secuencia de L<bits|/bit> que, por una vez, se puede considerar una secuencia de bits.

source: A sequence of characters such as "He said !@#*&%@#*?!".
es: Secuencia de caracteres como "Dijo !@#*&%@#*?!".

source: A series of L<processes|/process> all in a row, linked by L<pipes|/pipe>, where each passes its output stream to the next.
es: Serie de L<procesos|/proceso> seguidos, vinculados mediante L<tuberías|/tubería>, cada una de las cuales pasa la secuencia de salida al siguiente proceso.

source: A series of characters matches that series of characters in the target string, so the pattern C<blurfl> would match "blurfl" in the target string.
es: Una serie de caracteres coincide con la serie de caracteres en la cadena usada para la comparación; así, el patrón C<blurfl> detectaría "blurfl" en la cadena.

source: A set of L<directories|/directory> and L<files|/file> residing on a partition of the disk.
es: Conjunto de L<directorios|/directorio> y L<archivos|/archivo> que residen en una partición del disco.

source: A set of possible values, together with all the operations that know how to deal with those values.
es: Conjunto de valores posibles, junto con todas las operaciones que manipulan esos valores.

source: A set of related data values in a L</file> or L</stream>, often associated with a unique L</key> field.
es: Conjunto de valores de datos relacionados de un L</archivo> o una L</secuencia> que suelen estar asociados con un campo de L</clave> única.

source: A set of users of which you are a member.
es: Conjunto de usuarios del que usted forma parte.

source: A simple comment in the code giving credit to the FAQ would be courteous but is not required.
es: Le agradeceremos que incluya en su código una mención a estos documentos de preguntas más frecuentes, pero no le exigimos que lo haga.

source: A simple read-only accessor simply gets the value of a single attribute:
es: Un método de acceso de solo lectura simplemente obtiene el valor de un único atributo:

source: A simple, singular value; a number, L</string>, or L</reference>.
es: Valor singular, simple; un número, una L</cadena> o una L</referencia>.

source: A single character that represents the end of a line, with the ASCII value of 012 octal under Unix (but 015 on a Mac), and represented by C<\n> in Perl strings.
es: Carácter individual que representa el final de una línea, con un valor ASCII de 012 octal en Unix (015 en Mac) y que en las cadenas Perl se representa mediante C<\n>.

source: A single entity with various interpretations, like an elephant.
es: Una sola entidad con diversas interpretaciones, como un elefante.

source: A single piece of numeric or string data that is part of a longer L</string>, L</record>, or L</line>.
es: Elemento individual de datos numéricos o de cadena que forma parte de una L</cadena>, un L</registro> o una L</línea> de mayor longitud.

source: A slice accesses several elements of a list, an array, or a hash simultaneously using a list of subscripts.
es: Una porción permite acceder de forma simultánea a varios elementos de una lista, un array o un hash, mediante una lista de subíndices.

source: A slice of an empty list is still an empty list.
es: Una porción de una lista vacía es también una lista vacía.

source: A small integer representative of a unit of orthography.
es: Entero pequeño que representa una unida de ortografía.

source: A sound principle is to use only ranges that begin from and end at either alphabetics of equal case ([a-e], [A-E]), or digits ([0-9]).
es: Un buen principio es el de usar solo rangos que comiencen y terminen con caracteres alfabéticos del mismo tipo (solo minúsculas [a-e], solo mayúsculas [A-E]), o con dígitos ([0-9]).

source: A special L</method> that is called when an L</object> is thinking about L<destroying|/destroy> itself.
es: L<Método|/método> especial que se llama cuando un L</objeto> desea L<destruirse|/destruir>.

source: A special file that contains other files.
es: Archivo especial que contiene otros archivos.

source: A special form is the C<(DEFINE)> predicate, which never executes its yes-pattern directly, and does not allow a no-pattern.
es: El predicado C<(DEFINE)> es una forma especial que nunca ejecuta directamente su patrón-sí, y no admite un patrón-no.

source: A special internal spot in which Perl keeps the information about the last L</file> on which you requested information.
es: Área interna especial en la que Perl mantiene información sobre el último L</archivo> del que se solicitó información.

source: A special kind of L</module> that does L</preprocessing> on your script just before it gets to the L</tokener>.
es: Tipo de L</módulo> especial que hace un L</preprocesamiento> del script justo antes de que llegue al L</tokenizador>.

source: A special kind of L</scalar context> used in conditionals to decide whether the L</scalar value> returned by an expression is L</true> or L</false>.
es: Tipo especial de L</contexto escalar> que se usa en expresiones condicionales para decidir si el L</valor escalar> devuelto por una expresión es L</verdadero> o L</falso>.

source: A special program that runs on the bare machine and hides the gory details of managing L<processes|/process> and L<devices|/device>.
es: Programa especial que se ejecuta directamente sobre la máquina y oculta los detalles poco agradables de la administración de L<procesos|/proceso> y L<dispositivos|/dispositivo>.

source: A special programming gizmo that keeps track of where you are in something that you're trying to iterate over.
es: Artilugio especial para programación que hace un seguimiento de dónde se está en algo que se intenta recorrer repetidamente.

source: A special thanks to Damian Conway, who didn't only suggest important changes, but also took the time to count the number of listed features and make a Perl 6 version to show that Perl will stay Perl.
es: Debemos un agradecimiento especial a Damian Conway, quien no sólo sugirió importantes cambios, sino que también se entretuvo en contar el número de características incluidas y creó una versión para Perl 6 con el fin de demostrar que Perl seguirá siendo Perl.

source: A specific object is often referred to as an B<instance> of a class.
es: Un objeto específico se suele llamar una B<instancia> de la clase.

source: A specification of how many spaces and digits and things to put somewhere so that whatever you're printing comes out nice and pretty.
es: Especificación de cuántos espacios, dígitos y demás hay que poner en algún lugar para que el resultado impreso sea atractivo.

source: A spot in your program where you've told the debugger to stop L<execution|/execute> so you can poke around and see whether anything is wrong yet.
es: Punto del programa en el que se indica al depurador que debe detener la L<ejecución|/ejecutar> para determinar si ya se ha producido alguna anomalía.

source: A square-bracketed list of characters used in a L</regular expression> to indicate that any character of the set may occur at a given point.
es: Lista de caracteres entre corchetes que se usa en una L</expresión regular> para indicar que cualquier carácter del conjunto puede ocurrir en un punto determinado.

source: A standard C library for doing L<buffered|/buffer> input and output to the L</operating system>.
es: Biblioteca de C estándar para entrada y salida con L<almacenamiento en búfer|/búfer> en el L</sistema operativo>.

source: A standard module whose practical hints and suggestions are received (and possibly ignored) at compile time.
es: Módulo estándar cuyos prácticos indicios y sugerencias se reciben (y posiblemente omiten) en tiempo de compilación.

source: A standard, bundled release of a system of software.
es: Versión estándar empaquetada de un sistema de software.

source: A string does not have to be entirely printable.
es: Una cadena no tiene por qué ser completamente imprimible.

source: A subpattern L</assertion> matching the L</null string> between L<characters|/character>.
es: L<Aserción|/aserción> de subpatrón que coincide con la L</cadena nula> entre L<caracteres|/carácter>.

source: A subroutine is often parameterized to accomplish different but related things depending on its input L<arguments|/argument>.
es: Una subrutina se suele parametrizar para realizar cosas distintas aunque relacionadas en función de sus L<argumentos|/argumento> de entrada.

source: A substring L<captured|/capturing> by a subpattern within unadorned parentheses in a L</regex>, also referred to as a capture group.
es: Subcadena L<capturada|/capturar> por un subpatrón escrito entre paréntesis simples en una L</expresión regular>; también se denomina grupo de captura.

source: A syntactic construct consisting of a sequence of Perl L<statements|/statement> that is delimited by braces.
es: Construcción sintáctica formada por una secuencia de L<instrucciones|/instrucción> Perl escritas entre llaves.

source: A syntactic construct representing a comma-separated list of expressions, evaluated to produce a L</list value>.
es: Construcción sintáctica que representa una lista de expresiones separadas por comas y que al evaluarse produce un L</valor de lista>.

source: A system that algorithmically writes code for you in a high-level language.
es: Sistema que usa un algoritmo para escribir código automáticamente en un lenguaje de alto nivel.

source: A system that writes code for you in a low-level language, such as code to implement the backend of a compiler.
es: Sistema que escribe código automáticamente en un lenguaje de bajo nivel; por ejemplo, el código que implementa el I<backend> de un compilador.

source: A template used in L</pattern matching>.
es: Plantilla usada en L</detección de patrones>.

source: A temporary holding location for data.
es: Ubicación para el almacenamiento temporal de datos.

source: A temporary value scheduled to die when the current statement finishes.
es: Valor temporal programado para morir cuando finalice la instrucción actual.

source: A test suite for the s2p converter.
es: Conjuntos de pruebas del conversor s2p.

source: A test that looks at such stringification thus doesn't need to have the system default flags hard-coded in it, just the caret.
es: Una prueba que examine esta conversión a cadena de caracteres no tiene por qué tener las marcas predeterminadas del sistema especificadas en el propio código, solo el signo de intercalación.

source: A text L</file> that is a program intended to be L<executed|/execute> directly rather than L<compiled|/compiler> to another form of file before execution.
es: L<Archivo|/archivo> de texto que es un programa que debe L<ejecutarse|/ejecutar> directamente, en lugar de L<compilarse|/compilador> a otro tipo de archivo antes de su ejecución.

source: A thread is lighter weight than a full process, in that a process could have multiple threads running around in it, all fighting over the same process's memory space unless steps are taken to protect threads from each other.
es: Un hilo de ejecución es más ligero que un proceso completo, en el sentido de que un proceso puede tener varios hilos de ejecución compitiendo en el mismo espacio de memoria del proceso, a menos que se tomen las medidas adecuadas para proteger a unos hilos de otros.

source: A token in a programming language such as a number or L</string> that gives you an actual L</value> instead of merely representing possible values as a L</variable> does.
es: Token de un lenguaje de programación, como un número o una L</cadena>, que proporciona un L</valor> real, en lugar de simplemente representar valores posibles, como una L</variable>.

source: A type definition in the C language.
es: Definición de tipo en el lenguaje C.

source: A typical invocation of L<h2xs|h2xs> for a pure Perl module is:
es: Una invocación típica de L<h2xs|h2xs> para crear un módulo Perl puro es:

source: A user ID.
es: El identificador de un usuario.

source: A user-defined L</type>, implemented in Perl via a L</package> that provides (either directly or by inheritance) L<methods|/method> (that is, L<subroutines|/subroutine>) to handle L<instances|/instance> of the class (its L<objects|/object>).
es: L<Tipo|/tipo> definido por el usuario, implementado en Perl mediante un L</paquete> que proporciona (de forma directa o mediante herencia) L<métodos|/método> (es decir, L<subrutinas|/subrutina>) para controlar L<instancias|/instancia> de la clase (sus L<objetos|/objeto>).

source: A value that happens to be a L</scalar> as opposed to a L</list>.
es: Valor que es un L</escalar>, en contraste con una L</lista>.

source: A value that is either L</true> or L</false>.
es: Valor que es L</verdadero> o L</falso>.

source: A valueless value represented in Perl by C<()>.
es: Valor sin valores que en Perl se representa mediante C<()>.

source: A variable whose value is the name of another variable or subroutine.
es: Variable cuyo valor es el nombre de otra variable o subrutina.

source: A venerable Stream EDitor from which Perl derives some of its ideas.
es: El venerable Stream EDitor del que Perl ha derivado algunas de sus ideas.

source: A venerable typesetting language from which Perl derives the name of its C<$%> variable and which is secretly used in the production of Camel books.
es: Venerable lenguaje de composición tipográfica del que Perl deriva el nombre de su variable C<$%> y que se usa en secreto para producir libros del camello.

source: A very large and constantly evolving language with several alternative and largely incompatible syntaxes, in which anyone can define anything any way they choose, and usually do.
es: Lenguaje muy grande y en constante evolución, con varias sintaxis alternativas y en gran medida incompatibles con las que todos pueden definir lo que deseen de la forma que prefieran, y normalmente lo hacen.

source: A well-defined sequence of steps, clearly enough explained that even a computer could do them.
es: Secuencia bien definida de pasos, lo suficientemente bien explicados como para que hasta un equipo informático pueda seguirlos.

source: A whiz-bang hardware gizmo (like a disk or tape drive or a modem or a joystick or a mouse) attached to your computer, that the L</operating system> tries to make look like a L</file> (or a bunch of files).
es: Artilugio de hardware prodigioso (como un disco, una unidad de cinta, un módem, una palanca de control o un ratón) conectado a su equipo que el L</sistema operativo> trata de hacer pasar por L</archivo> (o un conjunto de archivos).

source: A word boundary (C<\b>) is a spot between two characters that has a C<\w> on one side of it and a C<\W> on the other side of it (in either order), counting the imaginary characters off the beginning and end of the string as matching a C<\W>.
es: Un límite de palabra (C<\b>) es un punto que hay entre dos caracteres, un C<\w> a un lado y un C<\W> al otro (en cualquier orden), contando con que los caracteres imaginarios del principio y final de la cadena coinciden con C<\W>.

source: A word sufficiently ambiguous to be deemed illegal under L<use strict 'subs'|strict/strict subs>.
es: Palabra lo suficientemente ambigua como para no ser considerada válida cuando se activa L<use strict 'subs'|strict/strict subs>.

source: A word that has no other interpretation in the grammar will be treated as if it were a quoted string.
es: Una palabra que no tiene ninguna interpretación en la gramática se tratará como si fuera una cadena entrecomillada.

source: A word with a specific, built-in meaning to a L</compiler>, such as C<if> or L<delete|perlfunc/delete>.
es: Palabras con un significado predefinido específico para un L</compilador>, como C<if> o L<delete|perlfunc/delete>.

source: A zero-width negative look-ahead assertion.
es: Una aserción de inspección hacia adelante negativa de ancho cero.

source: A zero-width negative look-behind assertion.
es: Una aserción de inspección hacia atrás negativa de ancho cero.

source: A zero-width positive look-ahead assertion.
es: Una aserción de inspección hacia adelante positiva de ancho cero.

source: A zero-width positive look-behind assertion.
es: Una aserción de inspección hacia atrás positiva de ancho cero.

source: Abigail added file and patch size data for the 5.6.0 - 5.10 era.
es: Abigail agregó los datos sobre tamaño de archivos y parches correspondientes a la era 5.6.0 - 5.10.

source: Able to serve as an L</lvalue>.
es: Que puede funcionar como L</valor-izquierda>.
